<?php
return [
    "Taxis" => [
        'short' => "Πιστοποιητικό Φόρου",
        "details" => "ΦΕΦΠ, Ε1, επίσημο έγγραφο φόρου από την εφορία"
    ],
    "AcademicId" => ['short' => "Ακαδημαϊκή Ταυτότητα"],
    "NationalId" => ['short' => "Εθνική Ταυτότητα"],
    "Affidavit" => [
        'short' => 'Δήλωση ή Πιστοποιητικό',
        'details' => "Δήλωση Ν.1599/86, ή Πιστοποιητικό από το Γραφείο Διεθνών Υποθέσεων της Πάτρας"
    ],
    "deathCertificate" => ['short' => "Πιστοποιητικό Θανάτου"],
    "otherInformation" => ['short' => "Άλλες Πληροφορίες"],
];
